Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/checklists/checklist_disability.html.txt.tmx
Source language: en
Languages: ga

source: Checklist for people with disabilities and long-term illness
ga: Seicliosta do dhaoine faoi mhíchumas agus ar a bhfuil galar fadtéarmach

source: The lists and links below are to help you to check out all the main services and entitlements for people with disabilities. The focus is on adults with a long-term illness or disability likely to last at least one year
ga: Le cabhair a thabhairt duit iad na naisc agus na liostaí thíos an uile phríomhsheirbhís agus phríomhtheidlíocht atá ann do dhaoine faoi mhíchumas a sheiceáil

source: document.write("If you would like these links to remain available while you browse this website, you can 'pin' the checklist to the right-hand side of the website
ga: document.write("Más mian leat go bhfanfadh na nascanna seo ar fáil fad is atá an suíomh seo á bhrabhsáil agat, d’fhéadfá an seicliosta a 'ghreamadh' ar thaobh deis an tsuímh

source: It will remain in place until you click the 'X' in the top right-hand corner.");
ga: Fanfaidh an seicliosta ansin go dtí go chliceáltar an ‘X’ sa chúinne ag barr an taoibh dheis.");

source: The headings in the left hand column of each section link to general documents on the subject, and those in the right hand column link to details of specific payments or services
ga: Dírítear ar dhaoine fásta ar a bhfuil galar fadtéarmach nó atá faoi mhíchumas fadtéarmach is dócha a mhairfidh ar feadh bliain amháin ar a laghad

source: The National Advocacy Service (NAS) provides independent, confidential and free advocacy for people with disabilities - in particular people who are isolated from their community and services, have communication differences, are inappropriately accommodated, live in residential services or attend day services and have limited supports. The service is funded and supported by the Citizens Information Board. You can find contact details for advocates through the Citizens Information Find an Address service
ga: Tá naisc sna teidil sa cholún ar chlé i ngach mír le doiciméid ghinearálta faoin ábhar, agus tá naisc sa cholún ar dheis le sonraí faoi íocaíochtaí nó faoi sheirbhísí sonracha

source: │ Main social welfare payments │ Disability Allowance (means-tested) │
ga: │ Príomhíocaíochtaí leasa shóisialaigh │ Liúntas Míchumais (déantar tástáil mhaoine ina leith) │

source: │ │ Household Benefits Package │
ga: │ │ Pacáiste Sochar Teaghlaigh │

source: │ Extra social welfare benefits │ Respite Care Grant │
ga: │ Sochair leasa shóisialaigh bhreise │ Deontas Cúram Faoisimh │

source: │ Supplementary Welfare Allowance Scheme │ Rent Supplement │
ga: │ An Scéim Liúntais Leasa Fhorlíontaigh │ Forlíonadh Cíosa │

source: │ │ Diet and Heating Supplements │
ga: │ │ Forlíonta Aiste Bia agus Téimh │

source: │ │ Exceptional and Urgent Needs Payment │
ga: │ │ Íocaíocht ar Riachtanais Eisceachtúla agus Phráinneacha │

source: │ │ Back to School Clothing and Footwear Allowance │
ga: │ │ Liúntas Éadaí agus Coisbhirt chun filleadh ar Scoil │

source: │ │ Tax relief for disabled drivers and disabled passengers │
ga: │ │ Faoiseamh cánach do thiománaithe agus do phaisinéirí faoi mhíchumas │

source: │ A range of supports are available │ │
ga: │ Tá fáil ar réimse tacaíochtaí │ │

source: │ │ Mobility training for people with visual impairments │
ga: │ │ Oiliúint soghluaiseachta do dhaoine ar a bhfuil lagú amhairc │

source: │ │ Disabled Person's Parking Card │
ga: │ │ Cárta Páriceála Duine faoi Mhíchumas │

source: │ │ Parking facilities for people with disabilities │
ga: │ │ Áiseanna páirceála do dhaoine atá faoi mhíchumas │

source: Working while getting a disability payment
ga: Ag oibriú agus íocaíocht mhíchumais á fáil agat

source: │ │ Further Education and Training (FET) courses │
ga: │ │ Cúrsaí Breisoideachais agus Oiliúina (FET) │

source: │ │ Partial Capacity Benefit (for people on Illness Benefit for at least 6 months or on Invalidity Pension only) │
ga: │ │ Sochar Páirtchumais (do dhaoine ag a bhfuil Sochar Breoiteachta á fháil ar feadh 6 mhí ar a laghad nó daoine a fhaigheann an Pinsean Easláinte amháin) │

source: │ │ Rural Social Scheme │
ga: │ │ An Scéim Shóisialta Tuaithe │

source: │ │ Wage Subsidy Scheme │
ga: │ Íocaíochtaí míchumais agus obair │ An Scéim Fóirdheontas Tuarastail │

source: │ │ Workplace/equipment adaptation grants │
ga: │ │ Deontais oiriúnaithe trealaimh/láithair oibre │

source: │ │ Supported employment scheme │
ga: │ │ An scéim fostaíochta le tacaíocht │

source: │ │ Job interview interpreter grants │
ga: │ │ An Scéim Deontais um Ateangaire ag Agallamh Poist │

source: │ │ Personal reader grants │
ga: │ │ Deontais léitheoirí pearsanta │

source: │ │ Back to Education Allowance │
ga: │ │ Liúntas um Fhilleadh ar an Oideachas │

source: │ Options for people with disabilities │ Third-level education for students with disabilities │
ga: │ Roghanna do dhaoine faoi mhíchumas │ Oideachas tríú leibhéal do mhic léinn faoi mhíchumas │

source: │ │ Rehabilitation and training services for people with disabilities, sheltered workshops │
ga: │ │ Seirbhísí athshlánaithe agus oiliúna do dhaoine faoi mhíchumas, ceardlanna faoi leith sóisialta │

source: Health services and community supports
ga: Seirbhísí sláinte agus tacaíochtaí pobail

source: │ │ GP Visit card │
ga: │ │ Cárta Cuairte LG │

source: │ │ Home Care Package │
ga: │ │ Pacáiste Cúram Baile │

source: │ │ Day centres and day care │
ga: │ │ Ionaid lae agus cúram lae │

source: │ │ Health services for people with intellectual, physical or sensory disabilities │
ga: │ │ Seirbhísí sláinte do dhaoine faoi mhíchumas intleachtúil, fisiciúil nó céadfach │

source: │ │ Physical and Sensory Disability Database │
ga: │ │ Bunachar Sonraí um Míchumas Fisiciúil agus Céadfach │

source: │ Community care services │ Intellectual Disability Database │
ga: │ Seirbhísí cúram pobail │ Bunachar Sonraí um Míchumas Intleachtúil │

source: │ │ Nursing Homes Support Scheme │
ga: │ │ An Scéim Tacaíochta do Thithe Altranais │

source: │ │ Home help service │
ga: │ │ Seirbhís chúntóirí baile │

source: │ │ Occupational therapy services │
ga: │ │ Seirbhísí teiripe shaothair │

source: │ │ Public health nurses │
ga: │ │ Altraí sláinte poiblí │

source: │ │ Tax reliefs for people with a visual impairment │
ga: │ │ Faoiseamh cánach do dhaoine ar a bhfuil lagú amhairc │

source: │ │ Dependent Relative Tax Credit │
ga: │ │ Creidmheas cánach i leith gaol cleithiúnaigh │

source: │ │ Trust funds for permanently incapacitated people │
ga: │ │ Cistí iontaobhais do dhaoine faoi mhíchumas buan │

source: │ │ VAT refunds on aids and appliances used by people with disabilities │
ga: │ │ Aisíocaíochtaí CBL ar áiseanna agus trealamh in úsáid ag daoine faoi mhíchumas │

source: │ Introduction to tax credits and reliefs │ │
ga: │ Réamhrá ar chreidmheasanna cánach agus faoiseamh ó cháin ioncaim │ │

source: │ │ Tax relief on nursing home fees and for dependent relatives │
ga: │ │ Faoiseamh cánach ar tháillí tithe altranais agus ar son gaolta cleithiúnaigh │

source: │ │ Tax relief on the costs of employing a home carer │
ga: │ │ Faoiseamh cánach ar na costais a bhaineann le cúramóir baile a fhostú │

source: │ │ Home Carer's Tax Credit │
ga: │ │ Creidmheas Cánach do Chúramóirí Baile │

source: │ │ Housing Adaptation Grant for People with a Disability │
ga: │ │ Deontas Oiriúnaithe Tithe do Dhaoine faoi Mhíchumas │

source: │ │ Mobility Aids Grant Scheme │
ga: │ │ An Scéim Deontas Áiseanna Soghluaisteachta │

source: │ │ Applying for local authority housing │
ga: │ │ Iarratas a dhéanamh ar thithe údaráis áitiúil │

source: │ │ Looking for a flat or house to rent │
ga: │ │ Ag lorg árasáin nó tí ar cíos │

source: │ Adapting a home for an older or disabled person │ │
ga: │ Teach a oiriúnú do dhuine breacaosta nó do dhuine faoi mhíchumas │ │

source: │ │ Rental Accommodation Scheme │
ga: │ │ Scéim Chóiríochta Ar Cíos │

source: │ │ Home Renovation Incentive │
ga: │ │ An Dreasacht Athchóirithe Tí │

source: │ │ Housing Assistance Payment │
ga: │ │ Íocaíocht Cúnaimh Tithíochta │

source: AssistIreland contains information on assistive technology and a directory of products available from Irish suppliers for people with disabilities and older people
ga: Cuireann AssistIreland faisnéis ar fáil faoi theicneolaíocht chúnta mar aon le heolaire de tháirgí ar a bhfuil fáil ó sholáthróirí Éireannacha do dhaoine faoi mhíchumas agus do dhaoine breacaosta
